sample/dummy_1_20.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 25
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 25 tps: 49.93 qps: 5888.99 (r/w/o: 1497.96/4391.03/0.00) lat (ms,99%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 25 tps: 49.03 qps: 4753.62 (r/w/o: 963.53/3790.09/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 25 tps: 38.00 qps: 4518.96 (r/w/o: 742.99/3775.96/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 25 tps: 38.00 qps: 4112.99 (r/w/o: 794.00/3318.99/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 25 tps: 50.00 qps: 4532.10 (r/w/o: 1000.02/3532.07/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 25 tps: 48.00 qps: 4417.84 (r/w/o: 935.97/3481.87/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 25 tps: 35.00 qps: 4298.01 (r/w/o: 698.00/3600.01/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 25 tps: 46.00 qps: 4752.16 (r/w/o: 946.03/3806.13/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 25 tps: 48.00 qps: 4655.91 (r/w/o: 959.98/3695.93/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 25 tps: 49.00 qps: 4763.06 (r/w/o: 980.01/3783.05/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 25 tps: 50.00 qps: 4730.18 (r/w/o: 986.04/3744.14/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 25 tps: 47.00 qps: 4536.83 (r/w/o: 953.96/3582.86/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 25 tps: 37.00 qps: 4129.03 (r/w/o: 740.00/3389.02/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 25 tps: 44.00 qps: 4624.98 (r/w/o: 880.00/3744.99/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 25 tps: 47.00 qps: 4251.02 (r/w/o: 940.00/3311.01/0.00) lat (ms,99%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 25 tps: 47.00 qps: 4499.99 (r/w/o: 940.00/3559.99/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 25 tps: 43.00 qps: 4453.02 (r/w/o: 860.00/3593.01/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 25 tps: 44.00 qps: 4569.64 (r/w/o: 855.93/3713.71/0.00) lat (ms,99%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 25 tps: 41.00 qps: 4151.21 (r/w/o: 844.04/3307.17/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 25 tps: 49.00 qps: 4647.07 (r/w/o: 980.02/3667.06/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 25 tps: 41.00 qps: 4260.04 (r/w/o: 820.01/3440.03/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 25 tps: 44.00 qps: 4444.05 (r/w/o: 864.01/3580.04/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 25 tps: 45.00 qps: 4565.95 (r/w/o: 897.99/3667.96/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 25 tps: 44.00 qps: 4187.98 (r/w/o: 897.99/3289.98/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 25 tps: 45.00 qps: 4570.88 (r/w/o: 879.98/3690.91/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 25 tps: 42.00 qps: 4135.17 (r/w/o: 832.03/3303.13/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 25 tps: 42.00 qps: 4326.05 (r/w/o: 868.01/3458.04/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 25 tps: 47.00 qps: 4388.71 (r/w/o: 907.94/3480.77/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 25 tps: 41.00 qps: 4337.20 (r/w/o: 843.04/3494.16/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 25 tps: 45.00 qps: 4464.72 (r/w/o: 895.94/3568.77/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 25 tps: 46.00 qps: 4720.26 (r/w/o: 907.05/3813.21/0.00) lat (ms,99%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 25 tps: 45.00 qps: 4492.03 (r/w/o: 926.01/3566.03/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 25 tps: 43.00 qps: 4219.93 (r/w/o: 840.99/3378.94/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 25 tps: 41.00 qps: 4148.95 (r/w/o: 838.99/3309.96/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 25 tps: 41.00 qps: 4199.94 (r/w/o: 819.99/3379.95/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 25 tps: 45.00 qps: 4438.11 (r/w/o: 900.02/3538.08/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 25 tps: 45.00 qps: 4525.09 (r/w/o: 900.02/3625.07/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 25 tps: 48.00 qps: 4481.00 (r/w/o: 960.00/3521.00/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 25 tps: 39.00 qps: 4402.00 (r/w/o: 780.00/3622.00/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 25 tps: 48.00 qps: 4585.98 (r/w/o: 950.00/3635.98/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 25 tps: 45.00 qps: 4424.01 (r/w/o: 894.00/3530.01/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 25 tps: 44.00 qps: 4313.75 (r/w/o: 886.95/3426.80/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 25 tps: 49.00 qps: 4894.11 (r/w/o: 989.02/3905.09/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 25 tps: 39.00 qps: 4140.13 (r/w/o: 763.02/3377.10/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 25 tps: 44.00 qps: 4388.01 (r/w/o: 897.00/3491.01/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 25 tps: 45.00 qps: 4578.00 (r/w/o: 900.00/3678.00/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 25 tps: 46.00 qps: 4261.85 (r/w/o: 919.97/3341.88/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 25 tps: 40.00 qps: 4184.16 (r/w/o: 800.03/3384.13/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 25 tps: 40.00 qps: 4148.94 (r/w/o: 798.99/3349.95/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 25 tps: 47.00 qps: 4565.00 (r/w/o: 941.00/3624.00/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 25 tps: 48.00 qps: 4495.05 (r/w/o: 960.01/3535.04/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 25 tps: 41.00 qps: 4296.00 (r/w/o: 820.00/3476.00/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 25 tps: 44.00 qps: 4599.01 (r/w/o: 880.00/3719.01/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 25 tps: 43.00 qps: 4326.98 (r/w/o: 860.00/3466.98/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 25 tps: 45.00 qps: 4153.94 (r/w/o: 879.99/3273.95/0.00) lat (ms,99%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 25 tps: 44.00 qps: 4507.04 (r/w/o: 900.01/3607.03/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 25 tps: 39.00 qps: 4287.02 (r/w/o: 780.00/3507.02/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 25 tps: 47.00 qps: 4443.03 (r/w/o: 940.01/3503.02/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 25 tps: 48.00 qps: 4671.98 (r/w/o: 950.00/3721.98/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 25 tps: 41.00 qps: 4178.88 (r/w/o: 829.98/3348.90/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            53620
        write:                           214480
        other:                           0
        total:                           268100
    transactions:                        2681   (44.40 per sec.)
    queries:                             268100 (4439.96 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.3827s
    total number of events:              2681

Latency (ms):
         min:                                  342.91
         avg:                                  561.64
         max:                                  680.81
         99th percentile:                      646.19
         sum:                              1505766.44

Threads fairness:
    events (avg/stddev):           107.2400/0.51
    execution time (avg/stddev):   60.2307/0.13